### Series.
```text 
Series are vertical arrays capable of holding different type of data
labels are indexes
Series are 1D
```

In [3]:
import numpy as np
import pandas as pd

In [13]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array(my_list)
d = {1:10,2:20,3:30}

In [5]:
# to create a series from a list
pd.Series(my_list,index=labels)# to create series the syntax is pd.Series(data,indexes) if no indexes are provided default labels are shown 0,1,2

a    10
b    20
c    30
dtype: int64

In [6]:
# to create a series from a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [14]:
# to create a series from dictionary syntax remains the same
#note: when creatin a series from list or array the default labels were 0,1,2... until u didn't pass any custom labels but when creating a series
#from dictionary the key act as labels and the value acts as corresponding data
pd.Series(d)

1    10
2    20
3    30
dtype: int64

### DataFrame: 
```text
When you combine multiple series they form  a data frame
Pandas reads rows first when you give a list of lists,
and reads columns first when you give a dictionary.
```

In [16]:
# Creating a dataframe using a dictionary
data = {
    'Name':['John','Anna','Peter','Linda'],
    'Age':[28,34,29,42],
    'City':['NewYork','Paris','Berlin','London'],
    'salary':[65000,70000,62000,85000]
}
df =pd.DataFrame(data)
df

    Name  Age     City  salary
0   John   28  NewYork   65000
1   Anna   34    Paris   70000
2  Peter   29   Berlin   62000
3  Linda   42   London   85000

In [38]:
# Creating a daatafram using list
data_1 =[
    ['John',28,'NewYork',65000],
    ['Anna',34,'Paris',70000],
    ['Peter',29,'Berlin',62000],
    ['Linda',42,'London',85000]
]
labels_1 = ['name','age','city','salary']
# notice here we didn't passed any labels so it took defaule 0 1 2 3 whereas when we passed the dictionarry it took the labels as keys name city etc.
#visualixe it like name(label) john anna peter linda (this is a series ) in data frame there are multiple series and series label bceoms column headings
#if i wanted i can pass custom labels here in list like this by creating a label list and passing that as a index
df_1 = pd.DataFrame(data_1,index=labels_1)
## there are multiple ways to pass the labels as headers(column names)
#1. transpose
# df_1 = pd.DataFrame(data_1,index=labels_1).T
#2. pass labels to columns
df_1 = pd.DataFrame(data_1,columns=labels_1)
df_1

    name  age     city  salary
0   John   28  NewYork   65000
1   Anna   34    Paris   70000
2  Peter   29   Berlin   62000
3  Linda   42   London   85000

In [41]:
##Selection and indexing in data frames of columns
#1.Selecting one column
df_1['name']#to target single column you have to pass its name in the syntax df['column_name']
#2. Selecting multiple columns
df_1[['name','city']]#to target multiple columns you have to pass a list in the syntax df[['column_1','column_2'...so on]]

    name     city
0   John  NewYork
1   Anna    Paris
2  Peter   Berlin
3  Linda   London

In [53]:
#Creating New column
df_1['Designation'] = ['Doc.','Eng.','Doc.','Eng.'] # syntax is df['new column name'] = [list of values] . note add exact amonut of data as no. rows
df_1

    name  age     city  salary Designation
0   John   28  NewYork   65000        Doc.
1   Anna   34    Paris   70000        Eng.
2  Peter   29   Berlin   62000        Doc.
3  Linda   42   London   85000        Eng.

In [ ]:
# Removig columns
#axis = 0 --> works along side rows for columns vertical goes across rows downwards
#axis = 1 --> works along side cols  for rows horizontal goes across columns
# df_1.drop("Designation",axis=1) # syntax df.drop("column name",axis = 0 or 1) # if 1 then it'll be cols if 0 then rows by default 0
# does not remove from the actuial data frame
# to remove from actual dataframe add inplace = True
df_1.drop("Designation",axis=1,inplace=True)
# to drop multiple cols pass in a list instead of 1 variable
df_1

    name  age     city  salary
0   John   28  NewYork   65000
1   Anna   34    Paris   70000
2  Peter   29   Berlin   62000
3  Linda   42   London   85000

In [59]:
# to drop rows
df_1.drop(0,axis=0)#just pass in the index of the row and axis as 0
df_1

    name  age     city  salary
0   John   28  NewYork   65000
1   Anna   34    Paris   70000
2  Peter   29   Berlin   62000
3  Linda   42   London   85000

In [67]:
####### to select rows
df_1.loc[0] # to select single row
df_1.loc[[0,1]] # to select multiple row
# if u want to do slicing u can also do that to select multiple rows
df_1.loc[0:2] # 2 is inclusive here

# you can also use df.iloc[index] iloc stands for index location and loc for location 
df.iloc[0]

Name         John
Age            28
City      NewYork
salary      65000
Name: 0, dtype: object

In [73]:
# Selecting subsets of rows and columns
df_1.loc[[0,1]][['city','salary']] # to select subsets the sytax is df.loc[rows][cols] now rows can contain a list for multiple rows or a single row
#and cols can also contain list for multiple cols or a single col
df_1.loc[[2,3]][['name','age']] # for example i wanted the 3rd and 4th row and there name and ages this is the proper syntax for doing that

    name  age
2  Peter   29
3  Linda   42

In [87]:
# conditional selextion
#1. i only want to see people with age greater than 30
mask = df_1['age'] > 30;
df_1[mask] # we create a mask the mask contains the conditio of age > 30 then we pass that mask to the data frame
#if i only wanted to see the name and age of people age > 30 i can use df.loc in the following manner
df_1.loc[mask,['name','age']] # syntax df.loc[mask,['col header names']]

#2. i only want to see people with age > 30 and they live in paris 
mask = (df_1['age'] > 30) & (df_1['city']=='Paris')
#note whenever you are using and or or operation make sure to use paranthesis
df_1[mask]

   name  age   city  salary
1  Anna   34  Paris   70000